{
  "backend/main.mo": "Motoko backend actor managing per-user diary entries (date, mood, reflection) stored in a Map by Principal, and providing 20 motivational messages with query endpoints for retrieval and entry management.",
  "feature_evidence.json": "Feature evidence report documenting the CEO attribution footer feature (Matheus Gama) in Layout.tsx with high confidence, linked to test REQ-14.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 13 frontend files covering styling, routing, pages (welcome, home, breathing, diary), components (forms, lists, cards), and custom hooks for queries and breathing timer logic.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining design tokens for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, Calma-Mente title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining root layout and four routes (/, /home, /breathing, /diary) with corresponding page components wrapped in Layout.",
  "frontend/src/components/DiaryEntryForm.tsx": "Form component with mood selector (8 options with emojis) and reflection textarea that submits diary entries via useAddDiaryEntry mutation with toast notifications.",
  "frontend/src/components/DiaryEntryList.tsx": "Scrollable list displaying user diary entries in reverse chronological order with mood emojis, formatted timestamps, and reflection text, handling loading and empty states.",
  "frontend/src/components/Layout.tsx": "App layout with header (logo, auth controls), background overlay, main content area, and footer featuring Android download button, CEO attribution (Matheus Gama), and caffeine.ai credit.",
  "frontend/src/components/MotivationalMessageCard.tsx": "Card component displaying motivational message with sparkle icon and refresh button, featuring gradient background and loading state support.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating and caching backend actor instances based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useBreathingTimer.ts": "Custom React hook that manages a breathing exercise timer with three phases (inhale, hold, exhale) of 4 seconds each, providing start/pause/reset controls and cycle counting.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching diary entries, adding new entries, and retrieving motivational messages from the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a calming sage green and lavender color palette, plus keyframe animations for breathing exercise visual effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BreathingExercisePage.tsx": "Breathing exercise page with animated visual guidance through inhale/hold/exhale cycles, displaying motivational messages after each completed cycle with auto-hide functionality.",
  "frontend/src/pages/DiaryPage.tsx": "Diary page requiring Internet Identity authentication, displaying a login prompt for unauthenticated users or a two-column layout with entry form and entry list for authenticated users.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying a random motivational message with refresh capability and two feature cards linking to breathing exercises and mindfulness diary sections.",
  "frontend/src/pages/WelcomePage.tsx": "Welcome/landing page component that displays the Calma-Mente logo, introduction text, and three navigation cards (Home, Breathing, Diary) with a 'Begin Your Journey' button.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, custom fonts (Inter), box shadows, border radius variables, and keyframe animations for accordions and fade-in effects.",
  "project_state.json": "Project state metadata tracking 11 implemented features including welcome screen, breathing exercises, diary with mood tracking, Internet Identity authentication, motivational messages, and Android download functionality."
}