{
  "backend/main.mo": "Motoko backend actor providing diary entry storage per user principal and a collection of 20 motivational messages (10 mindfulness-focused, 10 life-centric), with methods to add/retrieve entries and fetch all messages.",
  "feature_evidence.json": "Feature evidence report documenting the Android download button update in Layout.tsx, linking it to requirement REQ-15 with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 13 frontend files describing the meditation app's routing, UI components, hooks, and styling with calming color palette and breathing exercise functionality.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color system variables for light and dark themes with meditation-focused design tokens.",
  "frontend/index.html": "HTML entry point for the Calma-Mente app with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining four routes (welcome, home, breathing, diary) wrapped in Layout component with type-safe router setup.",
  "frontend/src/components/DiaryEntryForm.tsx": "Form component with mood selector (8 emoji options) and reflection textarea that submits diary entries to backend via React Query mutation with toast notifications.",
  "frontend/src/components/DiaryEntryList.tsx": "Scrollable list displaying user's diary entries in reverse chronological order with mood emojis, formatted timestamps, and loading/error states.",
  "frontend/src/components/Layout.tsx": "App layout with header (logo, auth controls), meditation background overlay, main content area, and footer featuring Android Play Store download link, CEO attribution (Matheus Gama), and caffeine.ai credit.",
  "frontend/src/components/MotivationalMessageCard.tsx": "Reusable card component displaying motivational messages with sparkle icon and refresh button, styled with gradient background and fade-in animation.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBreathingTimer.ts": "Custom React hook that manages a breathing exercise timer with phases (inhale, hold, exhale) cycling every 4 seconds, providing start/pause/reset controls and cycle count tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching diary entries and motivational messages, and mutating diary entries with automatic cache invalidation using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a calming sage green and lavender color palette, plus keyframe animations for breathing exercise visual effects (breathe-in, breathe-out, breathe-hold).",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped in QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/BreathingExercisePage.tsx": "Page component for guided breathing exercises with animated visual cues, phase instructions, and motivational messages displayed after completing breathing cycles.",
  "frontend/src/pages/DiaryPage.tsx": "Page component for the mindfulness diary that requires authentication, displaying a login prompt for unauthenticated users or a two-column layout with entry form and entry list for authenticated users.",
  "frontend/src/pages/HomePage.tsx": "Landing page component displaying a random motivational message and two feature cards linking to breathing exercises and mindfulness diary, with authentication-aware welcome messaging.",
  "frontend/src/pages/WelcomePage.tsx": "Welcome/landing page component that displays the Calma-Mente logo, app description, and three navigation cards (Home, Breathing, Diary) with a call-to-action button to begin.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, custom fonts (Inter), box shadows, border radius variables, and keyframe animations for accordions and fade-in effects.",
  "project_state.json": "Project state tracking document listing 11 implemented features for the Calma-Mente meditation app including welcome screen, breathing exercises, diary with mood tracking, Internet Identity auth, and motivational messages."
}