{
  "backend/main.mo": "Motoko backend actor managing per-user diary entries (date, mood, reflection) stored in a Map by Principal, and providing 20 motivational messages in Portuguese with query/mutation functions for diary CRUD and message retrieval.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing initialization errors, backend actor connection, and React Query setup, mapped to specific test IDs and component versions.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 13 frontend files covering styling, routing, pages (welcome, home, breathing, diary), components (layout, forms, lists, cards), and custom hooks for queries, breathing timer, and clipboard functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining design tokens for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Calma-Mente' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "React app root configuring QueryClient with retry/staleTime defaults, TanStack Router with Layout wrapper and four routes (welcome, home, breathing, diary), and Sonner toast provider.",
  "frontend/src/components/DiaryEntryForm.tsx": "Form component with mood selector (8 emoji options), reflection textarea, and submit handler that calls useAddDiaryEntry mutation with ISO date, displaying success/error toasts and clearing form on success.",
  "frontend/src/components/DiaryEntryList.tsx": "Scrollable list displaying user diary entries in reverse chronological order with mood emojis, formatted timestamps, and reflection text, handling loading/error/empty states via useGetMyEntries query.",
  "frontend/src/components/Layout.tsx": "App layout with header (logo, auth buttons showing principal slice), meditation background overlay, main content area, and footer with Android download link, share button with clipboard copy, and public URL display.",
  "frontend/src/components/MotivationalMessageCard.tsx": "Reusable card displaying motivational message with sparkle icon, italic quote styling, and refresh button that triggers onRefresh callback with loading state support.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication, automatically invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useBreathingTimer.ts": "React hook that manages a breathing exercise timer with three phases (inhale, hold, exhale) of 4 seconds each, providing start, pause, and reset controls along with cycle counting.",
  "frontend/src/hooks/useClipboard.ts": "React hook that provides clipboard copy functionality with state tracking for success/error and auto-resets the copied state after 2 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching diary entries, adding new entries, and retrieving motivational messages from the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a calming sage green and lavender color palette, plus keyframe animations for breathing exercise visual effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/BreathingExercisePage.tsx": "Page component for guided breathing exercises with animated visual cues, phase instructions, and motivational messages displayed after completing breathing cycles.",
  "frontend/src/pages/DiaryPage.tsx": "Page component for the mindfulness diary that requires authentication, displaying a login prompt for unauthenticated users or a two-column layout with entry form and entry list for authenticated users.",
  "frontend/src/pages/HomePage.tsx": "Main home page component that displays a welcome message, random motivational message card with refresh functionality, and navigation cards for breathing exercises and mindfulness diary features.",
  "frontend/src/pages/WelcomePage.tsx": "Welcome/landing page component that introduces Calma-Mente with logo, description, and three navigation cards (Home, Breathing, Diary) plus a call-to-action button to begin the journey.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme with OKLCH color system, custom fonts (Inter), extended shadows (soft, glow), custom animations (accordion, fade-in), and responsive container settings.",
  "project_state.json": "Project state file documenting Calma-Mente as a meditation/breathing app with 10 implemented features including welcome screen, breathing exercises, diary, Internet Identity auth, and motivational messages; notes a startup error as known issue."
}