{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: replacing IndexPage placeholder content with a functional home screen and updating the application title from 'New Application' to a meaningful name.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose and functionality, including pages, components, hooks, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining design tokens for light and dark modes with neutral grayscale palette.",
  "frontend/index.html": "HTML entry point with 'Starter Application' title and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app component configuring QueryClient, TanStack Router with root and index routes, Layout wrapper, and Toaster for notifications.",
  "frontend/src/components/DiaryEntryForm.tsx": "Empty file placeholder for diary entry form component.",
  "frontend/src/components/DiaryEntryList.tsx": "Empty file placeholder for diary entry list component.",
  "frontend/src/components/Layout.tsx": "Layout component with header containing 'Starter Application' branding and Internet Identity login/logout controls, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/MotivationalMessageCard.tsx": "Empty file placeholder for motivational message card component.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBreathingTimer.ts": "Empty file placeholder for breathing timer hook.",
  "frontend/src/hooks/useClipboard.ts": "Empty file placeholder for clipboard hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook providing Internet Identity authentication with login, logout, identity state management, and configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty file placeholder for React Query hooks.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system defining purple-tinted design tokens for light and dark modes with system fonts.",
  "frontend/src/main.tsx": "React application entry point wrapping App with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BreathingExercisePage.tsx": "Empty file placeholder for breathing exercise page.",
  "frontend/src/pages/DiaryPage.tsx": "Empty file placeholder for diary page.",
  "frontend/src/pages/HomePage.tsx": "Empty file placeholder for home page.",
  "frontend/src/pages/IndexPage.tsx": "Enhanced home page with hero section, welcome message, and two feature cards highlighting the tech stack (React, TypeScript, Internet Computer) and modern tooling.",
  "frontend/src/pages/WelcomePage.tsx": "Empty file placeholder for welcome page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom animations (accordion), border radius variables, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file documenting Calma-Mente meditation app features including start screen, breathing exercises, diary with mood tracking, Internet Identity authentication, and a known issue where the start screen is blank after deployment."
}